
/****************************************************************************
*
*文件名：DSP28_InitPeripherals.c
*
*功  能：对所使用到的2812的外设进行初始化
*
*作  者: likyo from hellodsp
*
****************************************************************************/

#include "DSP28_Device.h"

/****************************************************************************
*
*名    称：InitPeripherals()
*
*功    能：此函数对各个外设进行初始化，调用了各个外设的初始化函数。此函数在DSP
*          上电引导或者复位的时候执行          
*
*入口参数：无
*
*出口参数：无
*
****************************************************************************/

void InitPeripherals(void)
{

    #if F2812
    // 初始化外部接口
	// InitXintf();
	#endif

	// 初始化Cpu定时器
	// InitCpuTimers();

	// 初始化Mcbsp
	// InitMcbsp();

	// 初始化事件管理器EV
	// InitEv();
	
    // 初始化模数转换AD模块
	// InitAdc();
	
	// 初始化eCan
    // InitECan();

	// 初始化Spi
	// InitSpi();

	// 初始化Sci
	// InitSci();
}

//===========================================================================
// No more.
//===========================================================================
